IDEA StatiCa Open Model
PrestressLoading.PrimaryForces Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Primary internal force in section
 Namespace: IdeaRS.OpenModel.Concrete.Load
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ResultOfInternalForces PrimaryForces { get; set; }
Public Property PrimaryForces As ResultOfInternalForces
	Get
	Set
public:
property ResultOfInternalForces^ PrimaryForces {
	ResultOfInternalForces^ get ();
	void set (ResultOfInternalForces^ value);
}
Property Value
Type: ResultOfInternalForces
See Also
Reference
PrestressLoading Class
IdeaRS.OpenModel.Concrete.Load Namespace